import React from 'react';
import { Modal, Text } from "rizzui";

interface Props {
    modalState: boolean, setModalState: any
}

export const Policy = (props: Props) => {
    return (
        <>
            <Modal isOpen={props.modalState} onClose={() => props.setModalState(false)}>
                <div className="m-auto px-7 pt-6 pb-8 w-full">
                    <div className="mb-7 flex items-center justify-between">
                        <Text>
                            <h2>ຂໍ້ກໍານົດ ແລະ ເງື່ອນໄຂຂອງການບໍລິການ</h2>
                            <br />
                            <h3>ຍິນດີຕ້ອນຮັບທ່ານ ເຂົ້າສູ່ແອັບພິເຄຊັ່ນ ຟຟລ</h3>
                            <h3>EDL e-Service!</h3>
                            <br />
                            <p>ລັດວິສາຫະກິດໄຟຟ້າລາວ (ຟຟລ) ມີສຳນັກງານຕັ້ງຢູ່ ຖະໜົນມິດຕະພາບລາວ-ໄທ, ຕູ້ໄປສະນີ 309, ບ້ານທົ່ງກາງ, ເມືອງສີສັດຕະນາກ, ນະຄອນຫຼວງວຽງຈັນ (ຕໍ່ໄປນີ້ເອີ້ນວ່າ “ຟຟລ”).</p>
                        </Text>
                    </div>
                    <div className="mb-7 flex items-center justify-between">
                        <Text >
                            <h3><strong>1. ຄຳນຳ</strong></h3>
                            <p style={{ marginTop: "5px" }}>
                                ຂໍ້ກຳນົດ ແລະ ເງື່ອນໄຂຂອງການໃຫ້ບໍລິການເຫຼົ່ານີ້ ໄດ້ອະທິບາຍກົດລະບຽບ ແລະ ຂໍ້ບັງຄັບການນຳໃຊ້ EDL App.
                                ໂດຍການນໍາໃຊ້ແອັບພິເຄຊັ່ນນີ້, ພວກເຮົາຖືວ່າ ທ່ານຮັບຮູ້ ແລະ ຍອມຮັບ ຂໍ້ກໍານົດແລະເງື່ອນໄຂເຫຼົ່ານີ້. ຫ້າມສືບຕໍ່ນຳໃຊ້ EDL App ຖ້າຫາກວ່າທ່ານບໍ່ເຫັນດີກັບຂໍ້ກຳນົດ ແລະເງື່ອນໄຂທັງໝົດທີ່ລະບຸໄວ້ໃນໜ້ານີ້.
                            </p>
                            <p style={{ marginTop: "5px" }}>
                                ຄຳສັບຕໍ່ໄປນີ້ ນຳໃຊ້ສຳລັບກຳນົດ ແລະເງື່ອນໄຂເຫຼົ່ານີ້, ຄຳຊີ້ແຈງສິດທິຄວາມເປັນສ່ວນຕົວ ແລະ ແຈ້ງການປະຕິເສດຄວາມຮັບຜິດຊອບ ແລະ ຂໍ້ຕົກລົງທັງໝົດ: ລູກຄ້າ, ທ່ານ ແລະ ຂອງທ່ານ ຫມາຍເຖິງບຸກຄົນ ທີ່ເຂົ້າສູ່ລະບົບເວັບໄຊທ໌ນີ້ ແລະ ປະຕິບັດຕາມເງື່ອນໄຂຂອງ ລັດວິສາຫະກິດໄຟຟ້າລາວ. ບໍລິສັດ, ຕົວເຮົາເອງ, ພວກເຮົາ, ຂອງພວກເຮົາ ແລະ ພວກເຮົາ, ຫມາຍເຖິງ ບໍລິສັດຂອງພວກເຮົາ. ຄູ່ຮ່ວມ, ຝ່າຍ, ຫຼື ພວກເຮົາ, ຫມາຍເຖິງທັງລູກຄ້າ ແລະ ຕົວເຮົາເອງ.
                            </p>
                            <p style={{ marginTop: "5px" }}>
                                ຂໍ້ກໍານົດທັງຫມົດອີງຕາມ ການສະເຫນີ, ການຍອມຮັບ ແລະ ການພິຈາລະນາການຈ່າຍເງິນ ທີ່ຈໍາເປັນເພື່ອດໍາເນີນຂະບວນການຊ່ວຍເຫຼືອຂອງພວກເຮົາໃຫ້ແກ່ລູກຄ້າໃນລັກສະນະທີ່ເຫມາະສົມທີ່ສຸດ ເພື່ອຈຸດປະສົງສະແດງອອກເພື່ອຕອບສະຫນອງຄວາມຕ້ອງການຂອງລູກຄ້າໃນການບໍລິການທີ່ລະບຸໄວ້ຂອງ ຟຟລ, ຊຶ່ງປະຕິບັດຕາມລະບຽບການ ແລະ ຢູ່ພາຍໃຕ້ກົດໝາຍທີ່ມີການບັງຄັບໃຊ້ຂອງ ສປປ ລາວ. ການໃຊ້ຄໍາສັບຕ່າງໆຂ້າງເທິງ ຫຼື ຄໍາອື່ນໃນຄໍານາມ, ພະຫູພົດ, ຕົວພິມໃຫຍ່ ແລະ/ຫຼື ເຂົາ/ນາງ ຫຼື ພວກເຂົາ, ແມ່ນປະຕິບັດແລກປ່ຽນກັນໄດ້ ດັ່ງນັ້ນ, ຈຶ່ງມີຄວາມຫມາຍເຖິງດຽວກັນ. ຂໍ້ກໍານົດ ແລະ ເງື່ອນໄຂຂອງພວກເຮົາຖືກສ້າງຂຶ້ນໂດຍການຊ່ວຍເຫຼືອຂອງ EDL App.
                            </p>
                            <br />
                            <h3><strong>2. ສິດທິໃນການນຳໃຊ້</strong></h3>
                            <p style={{ marginTop: "5px" }}>
                                ເວັ້ນເສຍແຕ່ໄດ້ລະບຸໄວ້ເປັນຢ່າງອື່ນ, ຟຟລ ແລະ/ຫຼື ຜູ້ອອກໃບອະນຸຍາດເປັນທານຂອງສິດຊັບສິນທາງປັນຍາສຳລັບເອກະສານທັງໝົດໃນ ຟຟລ. ຂໍສະຫງວນລິຂະສິດຊັບສິນທາງປັນຍາທັງໝົດໄວ້. ທ່ານສາມາດເຂົ້າຫາມັນໄດ້ຈາກ ຟຟລ ສໍາລັບການນໍາໃຊ້ສ່ວນບຸກຄົນຂອງທ່ານ ໂດຍມີຂໍ້ຈໍາກັດທີ່ກໍານົດໄວ້ໃນຂໍ້ກໍານົດ ແລະ ເງື່ອນໄຂນີ້.
                            </p>
                            <h4>ທ່ານບໍ່ຄວນ:</h4>
                            <ul className='list-disc pl-10'>
                                <li>ເຜີຍແຜ່ເອກະສານຈາກ ຟຟລ;</li>
                                <li>ຂາຍ, ເຊົ່າ ຫຼື ໃບອະນຸຍາດຍ່ອຍຈາກ ຟຟລ;</li>
                                <li>ສຳເນົາ, ສຳເນົາ ຫຼື ສຳເນົາເອກະສານຈາກ ຟຟລ;</li>
                                <li>ແຈກຢາຍເນື້ອຫາຈາກ ຟຟລ;</li>
                                <li>ສັນຍາສະບັບນີ້ ຈະເລີ່ມຕົ້ນໃນວັນທີນີ້.</li>
                            </ul>
                            <p style={{ marginTop: "5px" }}>
                                ບາງສ່ວນຂອງ App ນີ້ສະເຫນີໂອກາດໃຫ້ຜູ້ໃຊ້ສາມາດໂພສ ແລະ ແລກປ່ຽນຄວາມຄິດເຫັນ ແລະ ຂໍ້ມູນຂ່າວສານໃນບາງພື້ນທີ່ຂອງເວັບໄຊທ໌. ຟຟລ ບໍ່ໄດ້ກັ່ນຕອງ, ດັດແກ້, ເຜີຍແຜ່ ຫຼື ທົບທວນຄືນຄຳເຫັນ ກ່ອນທີ່ຈະມີຢູ່ໃນເວັບໄຊທ໌. ຄວາມຄິດເຫັນບໍ່ໄດ້ສະທ້ອນເຖິງທັດສະນະ ແລະ ຄວາມຄິດເຫັນຂອງ ຟຟລ, ຕົວແທນ ແລະ/ຫຼື ສາຂາຂອງທ່ານ. ຄວາມຄິດເຫັນສະທ້ອນໃຫ້ເຫັນທັດສະນະ ແລະ ຄວາມຄິດເຫັນຂອງບຸກຄົນ ທີ່ສະແດງຄວາມຄິດເຫັນ ແລະ ຄວາມຄິດເຫັນຂອງເຂົາທານ. ພາຍໃນຂອບເຂດທີ່ກົດໝາຍບັງຄັບໃຊ້, ຟຟລ ຈະບໍ່ຮັບຜິດຊອບຕໍ່ຄຳເຫັນ ຫຼື ຄວາມຮັບຜິດຊອບ, ຄວາມເສຍຫາຍ ຫຼື ຄ່າໃຊ້ຈ່າຍໃດໆ ທີ່ເກີດຂຶ້ນ ຈາກການນຳໃຊ້ ແລະ/ຫຼື ການປະກາດ ແລະ/ຫຼື ການສະແດງຄວາມຄິດເຫັນໃນເວັບໄຊທ໌ນີ້. ຟຟລ ສະຫງວນສິດໃນການຕິດຕາມທຸກຄໍາຄິດເຫັນ ແລະ ຖອນຄໍາຄິດເຫັນໃດໆ ທີ່ພິຈາລະນາວ່າບໍ່ເໝາະສົມ, ເປັນຕາລັງກຽດ ຫຼື ເຮັດໃຫ້ເກີດການລະເມີດຂໍ້ກຳນົດ ແລະ ເງື່ອນໄຂເຫຼົ່ານີ້.
                            </p>
                            <h4>ທ່ານຮັບປະກັນ ແລະ ຮັບຮອງວ່າ:</h4>
                            <ul className='list-disc pl-10'>
                                <li>ທ່ານມີສິດທີ່ຈະຂຽນຄໍາເຫັນເທິງແອັບພິເຄຊັ່ນຂອງພວກເຮົາ ແລະ ໄດ້ຮັບໃບອະນຸຍາດ ແລະ ການຍິນຍອມທີ່ຈໍາເປັນທັງຫມົດໃນການດຳເນີນການດັ່ງກ່າວ;</li>
                                <li>ຄວາມຄິດເຫັນບໍ່ໄດ້ລະເມີດສິດທິຊັບສິນທາງປັນຍາໃດໆ ລວມເຖິງແຕ່ບໍ່ໄດ້ຈຳກັດໄວ້ພຽງລິຂະສິດ, ສິດທິບັດຫຼື ເຄື່ອງຫມາຍການຄ້າຂອງບຸກຄົນທີສາມ;</li>
                                <li>ຄຳເຫັນບໍ່ມີເນື້ອໃນໝິ່ນປະໝາດ, ໃສ່ຮ້າຍປ້າຍສີ, ຮຸນແຮງ, ກໍ່ກວນ, ບໍ່ເໝາະສົມ ຫຼື ຜິດກົດໝາຍ ຊຶ່ງເປັນການບຸກລຸກຄວາມເປັນສ່ວນຕົວ;</li>
                                <li>ຄຳເຫັນຈະບໍ່ຖືກນຳໃຊ້ເພື່ອເຊີນຊວນ ຫຼື ສົ່ງເສີມທຸລະກິດ ຫຼື ການເຄື່ອນໄຫວທາງການຄ້າ ຫຼື ການເຄື່ອນໄຫວທີ່ຜິດກົດໝາຍ;</li>
                                <li>ທ່ານອະນຸຍາດໃຫ້ ຟຟລ ນຳໃຊ້, ເຮັດຊ້ຳ, ແກ້ໄຂ ແລະ ອະນຸຍາດໃຫ້ຜູ້ອື່ນນຳໃຊ້, ເຮັດຊ້ຳ ແລະ ແກ້ໄຂຄຳເຫັນໃດໆຂອງທ່ານໃນທຸກຮູບແບບ ຫຼື ສື່ຕ່າງໆ ແລະ ທັງຫມົດ.</li>
                            </ul>
                            <br />
                            <h3><strong>3. ການເຊື່ອມຕໍ່ກັບແອັບພິເຄຊັ່ນຂອງພວກເຮົາ</strong></h3>
                            <p style={{ marginTop: "5px" }}>ການຈັດຕັ້ງຕໍ່ໄປນີ້ ອາດຈະເຊື່ອມຕໍ່ກັບ App ຂອງພວກເຮົາ ໂດຍບໍ່ມີການອະນຸມັດເປັນລາຍລັກອັກສອນກ່ອນ:</p>
                            <ul className='list-decimal pl-10'>
                                <li>ອົງການລັດຖະບານ;</li>
                                <li>ເຄື່ອງມືຄົ້ນຫາ;</li>
                                <li>ອົງການຂ່າວ;</li>
                                <li>ຜູ້ຈັດຈໍາຫນ່າຍໄດເລກະທໍລີອອນໄລນ໌ ອາດຈະເຊື່ອມຕໍ່ກັບແອັບຂອງພວກເຮົາໃນລັກສະນະດຽວກັນທີ່ເຊື່ອມໂຍງໄປຫາເວັບໄຊທ໌ຂອງທຸລະກິດທີ່ຈົດທະບຽນລາຍອື່ນໆ;</li>
                                <li>ທຸລະກິດທີ່ໄດ້ຮັບການຮັບຮອງຢ່າງກວ້າງຂວາງໃນລະບົບ ຍົກເວັ້ນການຮ້ອງຂໍອົງການຈັດຕັ້ງທີ່ບໍ່ຫວັງຜົນກໍາໄລ, ສູນການຄ້າເພື່ອການກຸສົນ ແລະ ກຸ່ມການລະດົມທຶນການກຸສົນທີ່ອາດຈະບໍ່ເຊື່ອມໂຍງກັບເວັບໄຊທ໌ຂອງພວກເຮົາ.</li>
                            </ul>
                            <p style={{ marginTop: "5px" }}>ອົງການຈັດຕັ້ງເຫຼົ່ານີ້ ອາດຈະເຊື່ອມຕໍ່ກັບຫນ້າທໍາອິດຂອງພວກເຮົາໄປຫາສິ່ງພິມ ຫຼື ຂໍ້ມູນ App ອື່ນໆ, ໃນກໍລະນີການເຊື່ອມຕໍ່:(ກ) ບໍ່ໄດ້ຢູ່ໃນວິທີການຫລອກລວງ; (ຂ) ບໍ່ໄດ້ອ້າງເຖິງການສະໜັບສະໜຸນ, ການຮັບຮອງ ຫຼື ການອະນຸມັດຂອງພາກສ່ວນທີ່ເຊື່ອມໂຍງ ແລະ ຜະລິດຕະພັນ ແລະ/ຫຼື ການບໍລິການຂອງຕົນໂດຍບໍ່ຖືກຕ້ອງ; ແລະ (ຄ) ເຫມາະສົມບໍລິບົດຂອງສະຖານທີ່ເຊື່ອມຕໍ່ຂອງພາກສ່ວນກ່ຽວຂ້ອງ.</p>
                            <p style={{ marginTop: "5px" }}>ພວກເຮົາ ອາດຈະພິຈາລະນາ ແລະ ອະນຸມັດການຮ້ອງຂໍການເຊື່ອມຕໍ່ອື່ນໆຈາກປະເພດຂອງການຈັດຕັ້ງ ຕໍ່ໄປນີ້:</p>
                            <ul className='list-disc pl-10'>
                                <li>ແຫຼ່ງຂໍ້ມູນຂ່າວສານຂອງຜູ້ບໍລິໂພກ ແລະ/ຫຼື ທຸລະກິດທີ່ຮູ້ຈັກທົ່ວໄປ;</li>
                                <li>dot.com ທີ່ເປັນເວັບໄຊຊຸມຊົນ;</li>
                                <li>ສະມາຄົມ ຫຼື ກຸ່ມອື່ນໆ ທີ່ເປັນຕົວແທນຂອງອົງການການກຸສົນ;</li>
                                <li>ຕົວແທນຈໍາຫນ່າຍໄດເລກະທໍລີອອນໄລນ໌;</li>
                                <li>ໜ້າເວັບໄຊທົ່ວໄປ;</li>
                                <li>ບໍລິສັດ ບັນຊີ, ບໍລິສັດ ກົດໝາຍ ແລະ ບໍລິສັດ ທີ່ປຶກສາ;</li>
                                <li>ສະຖາບັນການສຶກສາ ແລະ ສະມາຄົມການຄ້າ.</li>
                            </ul>
                            <p style={{ marginTop: "5px" }}>
                                ພວກເຮົາຈະອະນຸມັດການຮ້ອງຂໍການເຊື່ອມຕໍ່ຈາກອົງການຈັດຕັ້ງເຫຼົ່ານີ້, ຖ້າພວກເຮົາຕັດສິນໃຈວ່າ: (ກ) ການເຊື່ອມຕໍ່ຈະບໍ່ເຮັດໃຫ້ພວກເຮົາເບິ່ງບໍ່ພໍໃຈກັບຕົວເຮົາເອງ ຫຼື ທຸລະກິດທີ່ໄດ້ຮັບການຮັບຮອງຂອງພວກເຮົາ; (ຂ) ອົງການຈັດຕັ້ງບໍ່ມີບັນທຶກທາງລົບໃດໆກັບພວກເຮົາ; (ຄ) ຜົນປະໂຫຍດຂອງພວກເຮົາຈາກການເບິ່ງເຫັນ hyperlink ຊົດເຊີຍການຂາດ ຟຟລ; ແລະ (ງ) ການເຊື່ອມໂຍງແມ່ນຢູ່ໃນສະພາບການຂອງຂໍ້ມູນຊັບພະຍາກອນທົ່ວໄປ.
                                ອົງການຈັດຕັ້ງເຫຼົ່ານີ້ ອາດຈະເຊື່ອມຕໍ່ກັບຫນ້າທໍາອິດຂອງພວກເຮົາໄປຫາສິ່ງພິມ ຫຼື ຂໍ້ມູນ App ອື່ນໆ, ໃນກໍລະນີການເຊື່ອມຕໍ່:(ກ) ບໍ່ໄດ້ຢູ່ໃນວິທີການຫລອກລວງ; (ຂ) ບໍ່ໄດ້ອ້າງເຖິງການສະໜັບສະໜຸນ, ການຮັບຮອງ ຫຼື ການອະນຸມັດຂອງພາກສ່ວນທີ່ເຊື່ອມໂຍງ ແລະ ຜະລິດຕະພັນ ແລະ/ຫຼື ການບໍລິການຂອງຕົນໂດຍບໍ່ຖືກຕ້ອງ; ແລະ (ຄ) ເຫມາະສົມບໍລິບົດຂອງສະຖານທີ່ເຊື່ອມຕໍ່ຂອງພາກສ່ວນກ່ຽວຂ້ອງ.
                            </p>
                            <p style={{ marginTop: "5px" }}>
                                ຖ້າທ່ານເປັນໜຶ່ງໃນອົງການຈັດຕັ້ງທີ່ລະບຸໄວ້ໃນວັກ 2 ຂ້າງເທິງນີ້ ແລະ ມີຄວາມສົນໃຈໃນການເຊື່ອມຕໍ່ກັບ App ຂອງພວກເຮົາ, ທ່ານຕ້ອງແຈ້ງໃຫ້ພວກເຮົາຊາບໂດຍການສົ່ງອີເມວຫາ ຟຟລ. ກະລຸນາໃສ່ຊື່ຂອງທ່ານ, ຊື່ອົງການຂອງທ່ານ, ຂໍ້ມູນການຕິດຕໍ່ເຊັ່ນດຽວກັນກັບ URL ຂອງເວັບໄຊຂອງທ່ານ, ບັນຊີລາຍຊື່ຂອງ URL ໃດໆທີ່ທ່ານຕັ້ງໃຈຈະເຊື່ອມຕໍ່ກັບ App ຂອງພວກເຮົາ ແລະ ບັນຊີລາຍຊື່ຂອງ URL ຢູ່ໃນເວັບໄຊທີ່ທ່ານຕ້ອງການ. ເຊື່ອມຕໍ່. ກະລຸນາ ລໍຖ້າ 2-3 ອາທິດສໍາລັບການແຈ້ງຕອບ.
                            </p>
                            <p style={{ marginTop: "5px" }}>ອົງການຈັດຕັ້ງ ທີ່ໄດ້ຮັບການອະນຸມັດອາດຈະ hyperlink ກັບ App ຂອງພວກເຮົາດັ່ງຕໍ່ໄປນີ້:</p>
                            <ul className='list-disc pl-10'>
                                <li>ໂດຍການນໍາໃຊ້ຊື່ບໍລິສັດຂອງພວກເຮົາ;</li>
                                <li>ໂດຍການນໍາໃຊ້ຂອງສະຖານທີ່ຊັບພະຍາກອນເອກະພາບໄດ້ຖືກເຊື່ອມຕໍ່ກັບ;</li>
                                <li>ໂດຍການນໍາໃຊ້ຄໍາອະທິບາຍອື່ນໆຂອງ App ຂອງພວກເຮົາທີ່ມີການເຊື່ອມຕໍ່ກັບທີ່ເຮັດໃຫ້ຄວາມຮູ້ສຶກພາຍໃນສະພາບການ ແລະ ຮູບແບບຂອງເນື້ອໃນເວັບໄຊຂອງການເຊື່ອມຕໍ່.</li>
                                <li>ຈະບໍ່ອະນຸຍາດໃຫ້ໃຊ້ໂລໂກ້ຂອງ ຟຟລ ຫຼື Artwork ອື່ນໆ ສໍາລັບການເຊື່ອມຕໍ່ທີ່ບໍ່ມີສັນຍາອະນຸຍາດເຄື່ອງໝາຍການຄ້າ.</li>
                            </ul>
                            <br />
                            <h3><strong>4. iFrames</strong></h3>
                            <p style={{ marginTop: "5px" }}>ທ່ານອາດຈະບໍ່ສາມາດສ້າງຂອບອ້ອມຂ້າງເວັບໄຊຕ໌ຂອງພວກເຮົາ ໂດຍບໍ່ມີການອະນຸມັດລ່ວງຫນ້າ ແລະ ການອະນຸຍາດທີ່ເປັນລາຍລັກອັກສອນ, ທີ່ປ່ຽນແປງໃນວິທີການການນໍາສະເຫນີຮູບພາບ ຫຼື ຮູບລັກສະນະຂອງ App ຂອງພວກເຮົາ.</p>
                            <br />
                            <h3><strong>5.	ການນຳໃຊ້ຂໍ້ມູນ</strong></h3>
                            <ul className='list-decimal pl-10'>
                                <li>ຜູ້ໃຊ້ບໍລິການຍິນຍອມ ແລະ ຕົກລົງໃຫ້ ຟຟລ ເປີດເຜີຍ ແລະ ສົ່ງຂໍ້ມູນລາຍລະອຽດຂອງຜູ້ໃຊ້ບໍລິການທີ່ມີຢູ່ໄປຍັງລະບົບອື່ນທີ່ກ່ຽວຂ້ອງ ຊຶ່ງຂໍ້ມູນລວມເຖິງແຕ່ບໍ່ຈຳກັດໄວ້ພຽງ ຂໍ້ມູນການໃຫ້ບໍລິການຜ່ານລະບົບ, ຂໍ້ມູນສ່ວນບຸກຄົນ, ສະຖານທີ່ຕັ້ງ, ການກວດສອບຂໍ້ມູນ ລວມເຖິງຂໍ້ມູນສຳຄັນອື່ນໆ ເພື່ອການໃຫ້ບໍລິການມີຄວາມຄົບຖ້ວນສົມບູນ.</li>
                                <li>ຜູ້ໃຊ້ບໍລິການຍອມຮັບ ແລະ ຕົກລົງວ່າບັນດາຂໍ້ມູນສ່ວນບຸກຄົນ ແລະ ຂໍ້ມູນທັງໝົດທີ່ຜູ້ໃຊ້ບໍລິການໄດ້ນຳສົ່ງສຳລັບການສະໝັກສະມາຊິກ ແລະ ການໃຊ້ບໍລິການແອັບພິເຄຊັ່ນ ຟຟລ ເປັນຂໍ້ມູນທີ່ຖືກຕ້ອງຕາມຄວາມເປັນຈິງ. ຟຟລ ຂໍສະຫງວນສິດໃນການປ່ຽນແປງສິດທິປະໂຫຍດ ແລະ ຍົກເລີກສະມາຊິກ ແອັບພິເຄຊັ່ນ ຟຟລ ໃນກໍລະນີກວດພົບວ່າຂໍ້ມູນດັ່ງກ່າວບໍ່ຖືກຕ້ອງ.</li>
                                <li>ຜູ້ໃຊ້ບໍລິການຂໍຮັບຮອງ ແລະ ຮັບປະກັນວ່າ ຜູ້ໃຊ້ບໍລິການມີສິດຕາມກົດໝາຍໃນການໃຫ້ຂໍ້ມູນໃນການສະໝັກທັງໝົດແກ່ ຟຟລ ລວມເຖິງຫາກມີກໍລະນີທີ່ສະມາຊິກໃຫ້ຂໍ້ມູນຂອງບຸກຄົນທີສາມກັບ ຟຟລ ຜູ້ໃຊ້ບໍລິການຢືນຢັນວ່າ ບຸກຄົນດັ່ງກ່າວອະນຸຍາດໃຫ້ ຟຟລ ນຳໃຊ້ຂໍ້ມູນສ່ວນບຸກຄົນຕາມນະໂຍບາຍຄວາມເປັນສ່ວນຕົວຂອງ ຟຟລ ລວມທັງຮັບຮອງ ແລະ ຮັບປະກັນວ່າໄດ້ແຈ້ງໃຫ້ບຸກຄົນດັ່ງກ່າວຮັບຊາບເຖິງນະໂຍບາຍຄວາມເປັນສ່ວນຕົວຂອງ ຟຟລ ແລ້ວ ແລະ/ຫຼື ໄດ້ຂໍຄວາມຍິນຍອມຈາກບຸກຄົນດັ່ງກ່າວ ໂດຍອີງຕາມລະບຽບການ ຫຼື ກົດໝາຍທີ່ກ່ຽວຂ້ອງ ກ່ອນຈະໃຫ້ຂໍ້ມູນບຸກຄົນທີສາມແກ່ ຟຟລ ແລ້ວ.</li>
                                <li>ຜູ້ໃຊ້ບໍລິການຍອມຮັບ ແລະ ຕົກລົງວ່າບັນດາຂໍ້ມູນທັງໝົດທີ່ເກີດຈາກການເຮັດທຸລະກຳຂອງທ່ານທີ່ກ່ຽວຂ້ອງກັບແອັບພິເຄຊັ່ນ ຟຟລ ນັ້ນ ເປັນຊັບສິນຂອງ ຟຟລ ຕາບໃດທີ່ບໍ່ຂັດກັບກົດໝາຍທີ່ກ່ຽວຂ້ອງ.</li>
                                <li>ຜູ້ໃຊ້ບໍລິການຍິນຍອມ ແລະ ໝອບໝາຍໃຫ້ ຟຟລ ນຳໃຊ້ ຫຼື ແລກປ່ຽນຂໍ້ມູນສ່ວນບຸກຄົນຂອງຜູ້ໃຊ້ບໍລິການທີ່ໄດ້ໃຫ້ໄວ້ ບໍ່ວ່າໂດຍ ຟຟລ ຫຼື ຄູ່ຄ້າຂອງ ຟຟລ ສຳລັບການບໍລິຫານຈັດການ ລວມເຖິງທຸລະກຳກ່ຽວກັບບໍລິການຂອງແອັບພິຄຊັ່ນ ຟຟລ ໃນລັກສະນະທີ່ເຫັນວ່າຈະເປັນປະໂຫຍດແກ່ຜູ້ໃຊ້ບໍລິການ.</li>
                            </ul>
                            <br />
                            <h3><strong>6.	ຄວາມເປັນສ່ວນຕົວ</strong></h3>
                            <ul className='list-decimal pl-10'>
                                <li>ຖ້າເປັນໄປໄດ້, ພວກເຮົາຈະລວບລວມ, ປະມວນຜົນ, ນຳໃຊ້, ເປີດເຜີຍ, ເກັບຮັກສາ ຫຼື ໃຊ້ຂໍ້ມູນສ່ວນບຸກຄົນຂອງທ່ານ ເພື່ອການດຳເນີນທຸລະກິດ ແລະ ປະຕິບັດຕາມກົດໝາຍຢ່າງຖືກຕ້ອງເທົ່ານັ້ນ;</li>
                                <li>ຖ້າພວກເຮົາຂໍຂໍ້ມູນສ່ວນບຸກຄົນຈາກທ່ານ, ທ່ານອາດຈະປະຕິເສດທີ່ຈະໃຫ້ຂໍ້ມູນສ່ວນບຸກຄົນນັ້ນ. ເຖິງຢ່າງໃດກໍ່ຕາມ ເຮົາອາດປະຕິເສດການໃຫ້ບໍລິການແກ່ທ່ານເຊັ່ນດຽວກັນ.</li>
                            </ul>
                            <br />
                            <h3><strong>7.	ການສະໜອງຂໍ້ມູນ</strong></h3>
                            <p style={{ marginTop: "5px" }}>ທ່ານຈະສະໜອງຂໍ້ມູນທີ່ກ່ຽວຂ້ອງກັບທ່ານ ຫຼື ການໃຊ້ບໍລິການຂອງທ່ານກັບພວກເຮົາ ຕາມທີ່່່່່ເຮົາຕ້ອງການຕາມຄວາມເໝາະສົມ ເພື່ອ:</p>
                            <ul className='list-decimal pl-10'>
                                <li>ຊ່ວຍພວກເຮົາໃນການປະຕິບັດຕາມກົດໝາຍທີ່ມີການບັງຄັບໃຊ້ ແລ ລາຍງານຕໍ່ໜ່ວຍງານຂອງລັດ ກ່ຽວກັບການປະຕິບັດການດັ່ງກ່າວ;</li>
                                <li>ປະເມີນວ່າ ທ່ານໄດ້ປະຕິບັດຕາມ ຫຼື ບໍ່ ແລະ ສາມາດປະຕິບັດຕາມພັນທະຜູກພັນທັງໝົດພາຍໃຕ້ຂໍ້ກຳນົດ ແລະ ເງື່ອນໄຂການໃຫ້ບໍລິການ.</li>
                            </ul>
                            <br />
                            <h3><strong>8.	ຄວາມຮັບຜິດຊອບຂອງເນື້ອຫາ</strong></h3>
                            <p style={{ marginTop: "5px" }}>ພວກເຮົາຈະບໍ່ຮັບຜິດຊອບຕໍ່ເນື້ອຫາໃດໆ ທີ່ສະແດງຢູ່ໃນ App ຂອງທ່ານ. ທ່ານຕົກລົງທີ່ຈະປ້ອງກັນ ແລະ ປົກປ້ອງພວກເຮົາຕໍ່ການຮຽກຮ້ອງທັງຫມົດທີ່ເພີ່ມຂຶ້ນໃນ App ຂອງພວກເຮົາ. ບໍ່ມີການເຊື່ອມຕໍ່ໃດໆຄວນຈະສະແດງຢູ່ໃນເວັບໄຊທ໌ໃດຫນຶ່ງ ທີ່ອາດຈະຕີຄວາມໝາຍເປັນການໝິ່ນປະໝາດ, ລາມົກອານາຈານ ຫຼື ລະເມີດທາງອາຍາ ຫຼື ສະຫນັບສະຫນູນການລະເມີດ ຫຼື ການລະເມີດສິດທິຂອງບຸກຄົນທີສາມ.</p>
                            <br />
                            <h3><strong>9.	ການສະຫງວນສິດ</strong></h3>
                            <p style={{ marginTop: "5px" }}>ພວກເຮົາສະຫງວນສິດໃນການຮ້ອງຂໍໃຫ້ທ່ານລຶບການເຊື່ອມຕໍ່ທັງຫມົດ ຫຼື ການເຊື່ອມຕໍ່ສະເພາະໃດຫນຶ່ງ ທີ່ເຊື່ອມໄປຫາ App ຂອງພວກເຮົາ. ທ່ານຕົກລົງໃຫ້ລຶບທຸກລິ້ງໄປຫາແອັບຂອງພວກເຮົາທັນທີຕາມການຮ້ອງຂໍ. ພວກເຮົາຍັງສະຫງວນສິດທີ່ຈະແກ້ໄຂຂໍ້ກໍານົດ ແລະ ເງື່ອນໄຂເຫຼົ່ານີ້ ແລະ ມັນເປັນນະໂຍບາຍການເຊື່ອມຕໍ່ໄດ້ທຸກເວລາ. ການເຊື່ອມຕໍ່ຢ່າງຕໍ່ເນື່ອງກັບ App ຂອງພວກເຮົາ, ທ່ານຕົກລົງເຫັນດີທີ່ຈະຜູກມັດ ແລະ ປະຕິບັດຕາມຂໍ້ກໍານົດ ແລະ ເງື່ອນໄຂການເຊື່ອມຕໍ່ເຫຼົ່ານີ້.</p>
                            <br />
                            <h3><strong>10.	ການກໍາຈັດການເຊື່ອມຕໍ່ຈາກແອັບພິເຄຊັ່ນຂອງພວກເຮົາ</strong></h3>
                            <p style={{ marginTop: "5px" }}>ຖ້າຫາກທ່ານພົບເຫັນການເຊື່ອມຕໍ່ໃນ App ຂອງພວກເຮົາທີ່ບໍ່ເໝາະສົມໃດຫນຶ່ງດ້ວຍເຫດຜົນໃດກໍ່ຕາມ, ທ່ານຈະຕ້ອງຕິດຕໍ່ ແລະ ແຈ້ງໃຫ້ພວກເຮົາຮັບຊາບຕະຫຼອດເວລາ. ພວກເຮົາຈະພິຈາລະນາການຮ້ອງຂໍໃຫ້ຖອນການເຊື່ອມຕໍ່, ແຕ່ພວກເຮົາບໍ່ມີພັນທະທີ່ຈະຕອບສະຫນອງກັບທ່ານໂດຍກົງ. ພວກເຮົາບໍ່ຮັບປະກັນວ່າຂໍ້ມູນຢູ່ໃນເວັບໄຊທ໌ນີ້ແມ່ນຖືກຕ້ອງ, ບໍ່ຮັບປະກັນຄວາມສົມບູນ ຫຼື ຄວາມຖືກຕ້ອງຂອງມັນ ແລະ ບໍ່ສັນຍາວ່າຈະຮັບປະກັນວ່າເວັບໄຊທ໌ຍັງມີຢູ່ ຫຼື ວ່າເອກະສານຢູ່ໃນເວັບໄຊທ໌ໄດ້ຖືກເກັບຮັກສາໄວ້ຢູ່ສະເໝີ.</p>
                            <br />
                            <h3><strong>11.	ຂໍ້ຈຳກັດຄວາມຮັບຜິດຊອບ</strong></h3>
                            <p style={{ marginTop: "5px" }} className='pl-10'>
                                ຕາມຂອບເຂດສູງສຸດທີ່ກົດຫມາຍທີ່ກ່ຽວຂ້ອງອະນຸຍາດ ພວກເຮົາຍົກເວັ້ນການເປັນຕົວແທນ, ການຮັບປະກັນ ແລະ ເງື່ອນໄຂທັງຫມົດ ທີ່ກ່ຽວຂ້ອງກັບ App ຂອງພວກເຮົາ ແລະ ການນໍາໃຊ້ເວັບໄຊທ໌ນີ້.
                                ບໍ່ມີສິ່ງໃດ ໃນຂໍ້ຈຳກັດຄວາມຮັບຜິດຊອບນີ້ ຈະ:
                            </p>
                            <ul className='list-disc pl-10'>
                                <li>ຈໍາກັດ ຫຼື ຍົກເວັ້ນຄວາມຮັບຜິດຊອບຂອງພວກເຮົາ ຫຼື ຂອງທ່ານ ສໍາລັບການເສຍຊີວິດ ຫຼື ການບາດເຈັບສ່ວນບຸກຄົນ;</li>
                                <li>ຈໍາກັດ ຫຼື ຍົກເວັ້ນຄວາມຮັບຜິດຊອບຂອງພວກເຮົາ ຫຼື ຂອງທ່ານ ສໍາລັບການສໍ້ໂກງ ຫຼື ການເປີດເຜີຍທີ່ບໍ່ຖືກຕ້ອງ;</li>
                                <li>ຈຳກັດຄວາມຮັບຜິດຊອບຂອງພວກເຮົາ ຫຼື ທ່ານ ໃນລັກສະນະໃດໆ ທີ່ບໍ່ໄດ້ຮັບອະນຸຍາດພາຍໃຕ້ກົດໝາຍທີ່ບັງຄັບໃຊ້;</li>
                                <li>ຍົກເວັ້ນຄວາມຮັບຜິດຊອບໃດໆຂອງພວກເຮົາ ຫຼື ທ່ານ ທີ່ອາດຈະບໍ່ໄດ້ຮັບການຍົກເວັ້ນ ພາຍໃຕ້ກົດຫມາຍທີ່ບັງຄັບໃຊ້.</li>
                            </ul>
                            <p style={{ marginTop: "5px" }} className='pl-10'>
                                ຂໍ້ຈໍາກັດ ແລະ ຂໍ້ຫ້າມຂອງຄວາມຮັບຜິດຊອບທີ່ກໍານົດໄວ້ໃນພາກນີ້ ແລະ ບ່ອນອື່ນ ໃນຄໍາປະຕິເສດນີ້: (ກ) ແມ່ນຂຶ້ນກັບວັກກ່ອນຫນ້າ; ແລະ (ຂ) ຄຸ້ມຄອງຄວາມຮັບຜິດຊອບທັງໝົດ ທີ່ເກີດຂື້ນພາຍໃຕ້ການປະຕິເສດຄວາມຮັບຜິດຊອບ, ລວມທັງຄວາມຮັບຜິດຊອບທີ່ເກີດຂຶ້ນໃນສັນຍາ, ໃນການຝ່າຝືນ ແລະ ການລະເມີດໜ້າທີ່ຕາມກົດໝາຍ.
                            </p>
                            <p style={{ marginTop: "5px" }} className='pl-10'>
                                ໃນເມື່ອໃດທີ່ເວັບໄຊທ໌ ແລະ ຂໍ້ມູນ ແລະ ການບໍລິການຢູ່ໃນເວັບໄຊທ໌ນີ້ ໃຫ້ບໍລິການໂດຍບໍ່ເສຍຄ່າໃຊ້ຈ່າຍ, ພວກເຮົາຈະບໍ່ຮັບຜິດຊອບຕໍ່ການສູນເສຍ ຫຼື ຄວາມເສຍຫາຍໃດໆ ທັງໝົດ.
                            </p>
                        </Text>
                    </div>
                </div>
            </Modal>
        </>
    );
}
